---
type: FormulaManager
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# FormulaManager

`Autodesk.Revit.DB.FormulaManager` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Evaluate | — | `public static string Evaluate ( ElementId parameterId , Document document , string formula )` |
| Method | GetFunctions | — | `public static IList < string > GetFunctions ()` |
| Method | GetOperators | — | `public static IList < string > GetOperators ()` |
| Method | Validate | — | `public static string Validate ( ElementId parameterId , Document document , string formula )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |